In [47]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
import os

In [48]:
data = pd.read_csv('Final_data.csv')

In [49]:
data.head()

   year       county      price
0  1996    Atlantic   108995.08
1  1996      Bergen   215173.58
2  1996  Burlington   138151.67
3  1996      Camden   106914.50
4  1996    Cape May   131862.67

In [50]:
data.dropna(how = 'any',inplace = True)

In [51]:
data.describe()

              year          price
count   526.000000     526.000000
mean   2008.614068  283136.891920
std       7.541713  107345.137676
min    1996.000000  106914.500000
25%    2002.000000  194959.142500
50%    2009.000000  266847.415000
75%    2015.000000  375071.895000
max    2021.000000  539979.500000

In [71]:
data["county"] = data["county"].astype('category')
data["county_cat"] = data["county"].cat.codes
data

     year       county      price  county_cat
0    1996    Atlantic   108995.08           0
1    1996      Bergen   215173.58           1
2    1996  Burlington   138151.67           2
3    1996      Camden   106914.50           3
4    1996    Cape May   131862.67           4
..    ...          ...        ...         ...
541  2021       Salem   160444.00          16
542  2021    Somerset   455499.00          17
543  2021      Sussex   289567.00          18
544  2021       Union   435891.00          19
545  2021      Warren   277534.00          20

[526 rows x 4 columns]

In [60]:
X = data.drop(["price","county"], axis=1)
y = data["price"]
print(X.shape, y.shape)

(526, 2) (526,)

In [61]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)

In [62]:
from sklearn.preprocessing import LabelEncoder

# Step 1: Label-encode data set
label_encoder = LabelEncoder()
label_encoder.fit(y)
encoded_y = label_encoder.transform(y)

In [66]:
from sklearn.linear_model import LinearRegression
classifier = LinearRegression()
classifier

LinearRegression()

In [68]:
classifier.fit(X_train, y_train)

LinearRegression()

In [69]:
predictions = classifier.predict(X_test)
print(f"First 10 Predictions:   {predictions[:10]}")

First 10 Predictions:   [249568.41420529 330059.30442751 292142.60790844 301590.9582626
 237978.77313365 340262.51672164 215431.05782789 291136.1253218
 341017.37866162 282822.5830985 ]

In [72]:
print(y_test)

211    526519.42
466    377710.58
249    303185.00
344    318479.67
115    177641.00
         ...
188    292336.17
431    312580.00
524    255353.17
386    364286.92
304    262396.42
Name: price, Length: 132, dtype: float64

In [70]:
print(X_test)

     year  county_cat
211  2006           1
466  2018           4
249  2007          18
344  2012           8
115  2001          10
..    ...         ...
188  2004          20
431  2016          11
524  2020          20
386  2014           8
304  2010          10

[132 rows x 2 columns]

In [74]:
classifier.score(X_train,y_train)

0.21476096725869032